`terraform plan`
<details>

```
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.members.github_membership.member["Eraxyso"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "Eraxyso"
    }

  # module.members.github_membership.member["Hyde616"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "Hyde616"
    }

  # module.members.github_membership.member["PonponJuice"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "PonponJuice"
    }

  # module.members.github_membership.member["cho3881392697"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "cho3881392697"
    }

  # module.members.github_membership.member["parahailob"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "parahailob"
    }

  # module.members.github_membership.member["shobonvip"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "shobonvip"
    }

  # module.members.github_membership.member["yuiveslkao"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "yuiveslkao"
    }

  # module.teams["traOJudge"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "traO Judge"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "traOJudge"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.teams["traOJudge"].github_team_members.team_members will be created
  + resource "github_team_members" "team_members" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "kenken714"
        }
      + members {
          + role     = "member"
          + username = "Eraxyso"
        }
      + members {
          + role     = "member"
          + username = "ErrorSyntax1"
        }
      + members {
          + role     = "member"
          + username = "Kaki256"
        }
      + members {
          + role     = "member"
          + username = "PonponJuice"
        }
      + members {
          + role     = "member"
          + username = "Pugma"
        }
      + members {
          + role     = "member"
          + username = "Sotatsu57"
        }
      + members {
          + role     = "member"
          + username = "YuHima03"
        }
      + members {
          + role     = "member"
          + username = "ZOI-dayo"
        }
      + members {
          + role     = "member"
          + username = "cho3881392697"
        }
      + members {
          + role     = "member"
          + username = "comavius"
        }
      + members {
          + role     = "member"
          + username = "dye8128"
        }
      + members {
          + role     = "member"
          + username = "hayatroid"
        }
      + members {
          + role     = "member"
          + username = "kisepichu"
        }
      + members {
          + role     = "member"
          + username = "mathsuky"
        }
      + members {
          + role     = "member"
          + username = "noya2ruler"
        }
      + members {
          + role     = "member"
          + username = "ogu-kazemiya"
        }
      + members {
          + role     = "member"
          + username = "parahailob"
        }
      + members {
          + role     = "member"
          + username = "ramdos0207"
        }
      + members {
          + role     = "member"
          + username = "shobonvip"
        }
      + members {
          + role     = "member"
          + username = "yuiveslkao"
        }
      + members {
          + role     = "member"
          + username = "zer0-star"
        }
    }

  # module.hackathon.module.h24s_children_teams["h24s_04"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301520"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "Hyde616"
        }

        # (4 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_parent_team.github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10278337"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "member"
          + username = "Hyde616"
        }

        # (72 unchanged blocks hidden)
    }

Plan: 9 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>